use UNIVER
go

insert into STUDENT(IDGROUP, NAME, BDAY, INFO)
values (6, 'Хованский Т.А.', '24.12.2002',
        N'<студент>
                   <паспорт серия="МС" номер="1234567" дата="01.01.1970" />
                   <телефон>375445743464</телефон>
                   <адрес>
                      <страна>Беларусь</страна>
                      <город>Минск</город>
                      <улица>Белорусская</улица>
                      <дом>21</дом>
                      <квартира>1208</квартира>
                   </адрес>
                </студент>');
select *
from STUDENT
where NAME = 'Хованский Т.А.';
update STUDENT
set INFO = N'<студент>
					           <паспорт серия="МС" номер="1234567" дата="01.05.2012" />
						       <телефон>375331001010</телефон>
							   <адрес>
								  <страна>Беларусь</страна>
								  <город>Минск</город>
								  <улица>Белорусская</улица>
	         					  <дом>21</дом>
								  <квартира>1208</квартира>
								</адрес>
							 </студент>'
where NAME = 'Хованский Т.А.';

select NAME[ФИО],
       INFO.value('(студент/паспорт/@серия)[1]', 'char(2)') [Серия паспорта],
       INFO.value('(студент/паспорт/@номер)[1]', 'varchar(20)') [Номер паспорта],
       INFO.query('/студент/адрес') [Адрес]
from STUDENT
where NAME = 'Хованский Т.А.';


